RIET/src/InformationRegisters/СтавкиНалогаНаИмущество/СтавкиНалогаНаИмущество.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтавкиНалогаНаИмущество</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>НалоговаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсвобождениеОтНалогообложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КодНалоговойЛьготыОсвобождениеОтНалогообложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СнижениеНалоговойСтавки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьСниженнаяНалоговаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УменьшениеСуммыНалогаВПроцентах</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентУменьшения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НалоговаяСтавкаДвижимоеИмущество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсвобождениеОтНалогообложенияДвижимогоИмущества</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СнижениеНалоговойСтавкиДвижимоеИмущество</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриНаличии1ЛьготыЗаполнять1ЛистРаздела2</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/СтавкиНалогаНаИмущество/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// { RGS LFedotova 14.02.2018 10:20:33 - вопрос SLI-0007489
	//Справочники.Организации.ДополнитьДанныеЗаполненияПриОднофирменномУчете(ДанныеЗаполнения);
	ДанныеЗаполнения = Неопределено;
	// } RGS LFedotova 14.02.2018 10:22:47 - вопрос SLI-0007489 
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Для каждого Запись Из ЭтотОбъект Цикл
			РегистрыСведений.СтавкиНалогаНаИмущество.УстановкаНастроекПоУмолчанию(Запись, Новый Структура);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Для каждого Запись Из ЭтотОбъект Цикл
			РегистрыСведений.СтавкиНалогаНаИмущество.УстановкаНастроекПоУмолчанию(Запись, ДанныеЗаполнения);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	ПроверятьКодНалоговойЛьготыОсвобождениеОтНалогообложения = Ложь;
	ПроверятьПроцентУменьшения = Ложь;
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.ОсвобождениеОтНалогообложения Тогда
			ПроверятьКодНалоговойЛьготыОсвобождениеОтНалогообложения = Истина;
		КонецЕсли;
		
		Если Запись.УменьшениеСуммыНалогаВПроцентах Тогда
			ПроверятьПроцентУменьшения = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ПроверятьКодНалоговойЛьготыОсвобождениеОтНалогообложения Тогда
		МассивНепроверяемыхРеквизитов.Добавить("КодНалоговойЛьготыОсвобождениеОтНалогообложения");
	КонецЕсли;
	
	Если Не ПроверятьПроцентУменьшения Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПроцентУменьшения");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецЕсли
